cask_args appdir: '/Applications'
tap 'homebrew/bundle'

# Essential CLI tools
brew 'zsh-completions'
brew 'powerlevel10k'
brew 'cryptography'
brew 'coreutils'
brew 'dnsmasq'
brew 'archey4'
brew 'openjdk'
brew 'python'
brew 'neovim'
brew 'telnet'
brew 'netcat'
brew 'p7zip'
brew 'wget'
brew 'node'
brew 'nmap'
brew 'tree'
brew 'stow'
brew 'git'
brew 'zsh'
brew 'fzf'
brew 'bat'
brew 'lf'
brew 'jq'
brew 'yq'

# DEV CLI tools
brew 'docker-completion'
brew 'kubernetes-cli'
brew 'openshift-cli'
brew 'terraform'
brew 'ansible'
brew 'argocd'
brew 'vault'
brew 'helm'

# GUI tools
cask 'visual-studio-code'
cask 'keystore-explorer'
cask 'keepingyouawake'
cask 'microsoft-edge'
cask 'cleanmymac'
cask 'rectangle'
cask 'onedrive'
cask 'raycast'
cask 'aldente'
cask 'discord'
cask 'stremio'
cask 'postman'
cask 'docker'
cask 'iterm2'
cask 'notion'
cask 'maccy'
cask 'stats'
cask 'lens'
cask 'arc'
cask 'vlc'
